# SQL Assignment

In [1]:
from google.colab import drive
drive.mount('/content/drive/')

Mounted at /content/drive/

In [2]:
import pandas as pd
import sqlite3

from IPython.display import display, HTML

In [3]:
conn = sqlite3.connect('/content/drive/MyDrive/sql Ass/Db-IMDB-Assignment.db')

#### Overview of all tables

In [4]:
tables = pd.read_sql_query("SELECT NAME AS 'Table_Name' FROM sqlite_master WHERE type='table'",conn)
tables = tables["Table_Name"].values.tolist()

In [5]:
for table in tables:
    query = "PRAGMA TABLE_INFO({})".format(table)
    schema = pd.read_sql_query(query,conn)
    print("Schema of",table)
    display(schema)
    print("-"*100)
    print("\n")

Schema of Movie

   cid       name     type  notnull dflt_value  pk
0    0      index  INTEGER        0       None   0
1    1        MID     TEXT        0       None   0
2    2      title     TEXT        0       None   0
3    3       year     TEXT        0       None   0
4    4     rating     REAL        0       None   0
5    5  num_votes  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    CID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    LID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    LID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    CID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Person

   cid    name     type  notnull dflt_value  pk
0    0   index  INTEGER        0       None   0
1    1     PID     TEXT        0       None   0
2    2    Name     TEXT        0       None   0
3    3  Gender     TEXT        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Producer

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Director

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Cast

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------

## Useful tips:

1. the year column in 'Movie' table, will have few chracters other than numbers which you need to be preprocessed, you need to get a substring of last 4 characters, its better if you convert it as int type, ex: CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)

2. For almost all the TEXT columns we have show, please try to remove trailing spaces, you need to use TRIM() function

3. When you are doing count(coulmn) it won't consider the "NULL" values, you might need to explore other alternatives like Count(*)

## Q1 --- List all the directors who directed a 'Comedy' movie in a leap year. (You need to check that the genre is 'Comedy’ and year is a leap year) Your query should return director name, the movie name, and the year.

<h4>To determine whether a year is a leap year, follow these steps:</h4>

<ul>
    <li><b>STEP-1:</b> If the year is evenly divisible by 4, go to step 2. Otherwise, go to step 5.</li>
    <li><b>STEP-2:</b> If the year is evenly divisible by 100, go to step 3. Otherwise, go to step 4.</li>
    <li><b>STEP-3:</b> If the year is evenly divisible by 400, go to step 4. Otherwise, go to step 5.</li>
    <li><b>STEP-4:</b> The year is a leap year (it has 366 days).</li>
    <li><b>STEP-5:</b> The year is not a leap year (it has 365 days).</li>
</ul>

Year 1900 is divisible by 4 and 100 but it is not divisible by 400, so it is not a leap year.

In [27]:
%%time
def grader_1(q1):
    q1_results  = pd.read_sql_query(q1,conn)
    print(q1_results.head(10))
    assert (q1_results.shape == (246,3))

query1 = """ SELECT m.title,m.year,p.name FROM movie m JOIN M_Director md ON m.MID=md.MID 
JOIN person p ON md.PID=p.PID JOIN M_Genre mg ON m.MID=mg.MID JOIN Genre g ON mg.GID=g.GID 
WHERE g.name LIKE '%comedy%' AND m.year%4==0 """
grader_1(query1)

                               title    year               Name
0                         Mastizaade    2016       Milap Zaveri
1  Harold & Kumar Go to White Castle    2004       Danny Leiner
2                 Gangs of Wasseypur    2012     Anurag Kashyap
3        Around the World in 80 Days    2004       Frank Coraci
4             The Accidental Husband    2008      Griffin Dunne
5                             Barfi!    2012        Anurag Basu
6                  Bride & Prejudice    2004    Gurinder Chadha
7    Beavis and Butt-Head Do America    1996         Mike Judge
8                          Blackmail  I 2018        Abhinay Deo
9                            Dostana    2008   Tarun Mansukhani
CPU times: user 64.1 ms, sys: 80 µs, total: 64.2 ms
Wall time: 68.5 ms

## Q2 --- List the names of all the actors who played in the movie 'Anand' (1971)

In [28]:
%%time
def grader_2(q2):
    q2_results  = pd.read_sql_query(q2,conn)
    print(q2_results.head(10))
    assert (q2_results.shape == (17,1))


query2 = """SELECT Name FROM Person WHERE TRIM(PID) IN(SELECT TRIM(PID) FROM M_Cast 
WHERE TRIM(MID) IN(SELECT TRIM(MID) FROM Movie WHERE title='Anand')) """
grader_2(query2)

                Name
0   Amitabh Bachchan
1      Rajesh Khanna
2      Sumita Sanyal
3         Ramesh Deo
4          Seema Deo
5     Asit Kumar Sen
6         Dev Kishan
7       Atam Prakash
8      Lalita Kumari
9             Savita
CPU times: user 32.3 ms, sys: 0 ns, total: 32.3 ms
Wall time: 41.5 ms

## Q3 --- List all the actors who acted in a film before 1970 and in a film after 1990. (That is: < 1970 and > 1990.)

In [29]:
%%time

def grader_3a(query_less_1970, query_more_1990):
    q3_a = pd.read_sql_query(query_less_1970,conn)
    q3_b = pd.read_sql_query(query_more_1990,conn)
    return (q3_a.shape == (1927,1)) and (q3_b.shape == (26710,1))

query_less_1970 =""" SELECT DISTINCT p.name FROM person p WHERE TRIM(p.PID) IN (SELECT DISTINCT TRIM(c.PID) 
FROM M_Cast c WHERE TRIM(c.MID) IN (SELECT DISTINCT TRIM(m.MID) FROM movie m WHERE m.year<'1970'))"""
query_more_1990 =""" SELECT DISTINCT p.name FROM person p WHERE TRIM(p.PID) IN 
(SELECT DISTINCT TRIM(c.PID) FROM M_Cast c WHERE TRIM(c.MID) IN (SELECT DISTINCT TRIM(m.MID) FROM movie m WHERE m.year>'1990')) """
print(grader_3a(query_less_1970, query_more_1990))

# using the above two queries, you can find the answer to the given question

True
CPU times: user 209 ms, sys: 4.42 ms, total: 214 ms
Wall time: 215 ms

In [30]:
%%time
def grader_3(q3):
    q3_results  = pd.read_sql_query(q3,conn)
    print(q3_results.head(10))
    assert (q3_results.shape == (333,1))

query3 = """ SELECT DISTINCT p.name FROM person p WHERE TRIM(p.PID) IN (SELECT DISTINCT TRIM(c.PID) 
FROM M_Cast c WHERE TRIM(c.MID) IN (SELECT DISTINCT TRIM(m.MID) FROM movie m WHERE m.year<'1970')) 
AND TRIM (p.PID) IN(SELECT DISTINCT TRIM(c1.PID) FROM M_Cast c1 WHERE TRIM(c1.MID) IN 
(SELECT DISTINCT TRIM(m1.MID) FROM movie m1 WHERE m1.year>'1990')) """
grader_3(query3)

                Name
0       Rishi Kapoor
1   Amitabh Bachchan
2             Asrani
3       Zohra Sehgal
4    Parikshat Sahni
5      Rakesh Sharma
6        Sanjay Dutt
7          Ric Young
8              Yusuf
9     Suhasini Mulay
CPU times: user 140 ms, sys: 0 ns, total: 140 ms
Wall time: 145 ms

## Q4 --- List all directors who directed 10 movies or more, in descending order of the number of movies they directed. Return the directors' names and the number of movies each of them directed.

In [31]:
%%time

def grader_4a(query_4a):
    query_4a = pd.read_sql_query(query_4a,conn)
    print(query_4a.head(10)) 
    return (query_4a.shape == (1462,2))

query_4a ="""SELECT PID,count(PID) FROM M_Director GROUP BY PID"""
print(grader_4a(query_4a))

# using the above query, you can write the answer to the given question

         PID  count(PID)
0  nm0000180           1
1  nm0000187           1
2  nm0000229           1
3  nm0000269           1
4  nm0000386           1
5  nm0000487           2
6  nm0000965           1
7  nm0001060           1
8  nm0001162           1
9  nm0001241           1
True
CPU times: user 12.6 ms, sys: 0 ns, total: 12.6 ms
Wall time: 16.9 ms

In [32]:
%%time
def grader_4(q4):
    q4_results  = pd.read_sql_query(q4,conn)
    print(q4_results.head(10))
    assert (q4_results.shape == (58,2))

query4 = """SELECT p.Name,COUNT(md.PID) FROM Person p JOIN M_Director md ON md.PID=p.PID GROUP BY md.PID 
HAVING COUNT(md.PID)>=10 ORDER BY COUNT(md.PID) DESC;"""
grader_4(query4)

                    Name  COUNT(md.PID)
0           David Dhawan             39
1           Mahesh Bhatt             35
2           Priyadarshan             30
3        Ram Gopal Varma             30
4           Vikram Bhatt             29
5   Hrishikesh Mukherjee             27
6            Yash Chopra             21
7        Basu Chatterjee             19
8         Shakti Samanta             19
9           Subhash Ghai             18
CPU times: user 30.3 ms, sys: 0 ns, total: 30.3 ms
Wall time: 31.2 ms

## Q5.a --- For each year, count the number of movies in that year that had only female actors.

In [33]:
%%time

# note that you don't need TRIM for person table

def grader_5aa(query_5aa):
    query_5aa = pd.read_sql_query(query_5aa,conn)
    print(query_5aa.head(10)) 
    return (query_5aa.shape == (8846,3))

query_5aa ="""SELECT m.MID,p.gender, count(p.PID) count
FROM movie m
JOIN m_Cast mc ON m.MID = mc.MID
JOIN Person p
ON TRIM(mc.PID) = p.PID group by m.mid,p.gender """

print(grader_5aa(query_5aa))

def grader_5ab(query_5ab):
    query_5ab = pd.read_sql_query(query_5ab,conn)
    print(query_5ab.head(10)) 
    return (query_5ab.shape == (3469, 3))

query_5ab ="""SELECT m.MID,p.gender, count(p.PID) count
FROM movie m
JOIN m_Cast mc ON m.MID = mc.MID
JOIN Person p
ON TRIM(mc.PID) = p.PID
AND p.Gender = 'Male' group by m.MID """

print(grader_5ab(query_5ab))


# using the above queries, you can write the answer to the given question

         MID  Gender  count
0  tt0021594    None      1
1  tt0021594  Female      3
2  tt0021594    Male      5
3  tt0026274    None      2
4  tt0026274  Female     11
5  tt0026274    Male      9
6  tt0027256    None      2
7  tt0027256  Female      5
8  tt0027256    Male      8
9  tt0028217  Female      3
True
         MID Gender  count
0  tt0021594   Male      5
1  tt0026274   Male      9
2  tt0027256   Male      8
3  tt0028217   Male      7
4  tt0031580   Male     27
5  tt0033616   Male     46
6  tt0036077   Male     11
7  tt0038491   Male      7
8  tt0039654   Male      6
9  tt0040067   Male     10
True
CPU times: user 535 ms, sys: 23.7 ms, total: 559 ms
Wall time: 575 ms

In [34]:
%%time
def grader_5a(q5a):
    q5a_results  = pd.read_sql_query(q5a,conn)
    print(q5a_results.head(10))
    assert (q5a_results.shape == (4,2))

query5a = """SELECT m.year, COUNT(m.title) Female_Cast_Only_Movies
FROM movie m WHERE m.MID NOT IN ( SELECT DISTINCT m.MID FROM movie m
JOIN m_Cast mc ON m.MID = mc.MID
JOIN Person p
ON TRIM(mc.PID) = p.PID
AND p.Gender = 'Male')
AND m.MID IN
(SELECT DISTINCT m.MID
FROM movie M
JOIN m_cast mc ON m.MID = mc.MID
JOIN person p
ON TRIM(mc.PID) = p.PID
AND p.Gender = 'Female')
GROUP BY m.year
"""
grader_5a(query5a)

     year  Female_Cast_Only_Movies
0    1939                        1
1    1999                        1
2    2000                        1
3  I 2018                        1
CPU times: user 405 ms, sys: 12.7 ms, total: 418 ms
Wall time: 418 ms

## Q5.b --- Now include a small change: report for each year the percentage of movies in that year with only female actors, and the total number of movies made that year. For example, one answer will be: 1990 31.81 13522 meaning that in 1990 there were 13,522 movies, and 31.81% had only female actors. You do not need to round your answer.

In [35]:
%%time
def grader_5b(q5b):
    q5b_results  = pd.read_sql_query(q5b,conn)
    print(q5b_results.head(10))
    assert (q5b_results.shape == (4,3))

query5b = """SELECT DISTINCT a.YEAR, 
(a.Female_Movies * 100./COUNT(b.title)) AS "Percentage_Female_Only_Movie" ,COUNT(b.title) AS Total_Movies
FROM Movie AS b,
(SELECT m.YEAR, COUNT(DISTINCT m.title) AS Female_Movies
FROM movie m
WHERE m.MID NOT IN
( SELECT DISTINCT m.MID
FROM movie m
JOIN m_Cast mc ON m.MID = mc.MID
JOIN Person p
ON TRIM(mc.PID) = p.PID
AND p.Gender = 'Male')
AND m.MID IN
(SELECT DISTINCT m.MID
FROM movie M
JOIN m_cast mc ON m.MID = mc.MID
JOIN person p
ON TRIM(mc.PID) = p.PID
AND p.Gender = 'Female')
GROUP BY m.year) AS a
WHERE a.year = b.year
GROUP BY b.year"""
grader_5b(query5b)

     YEAR  Percentage_Female_Only_Movie  Total_Movies
0    1939                     50.000000             2
1    1999                      1.515152            66
2    2000                      1.562500            64
3  I 2018                     10.000000            10
CPU times: user 406 ms, sys: 7.38 ms, total: 413 ms
Wall time: 414 ms

## Q6 --- Find the film(s) with the largest cast. Return the movie title and the size of the cast. By "cast size" we mean the number of distinct actors that played in that movie: if an actor played multiple roles, or if it simply occurs multiple times in casts, we still count her/him only once.

In [36]:
%%time
def grader_6(q6):
    q6_results  = pd.read_sql_query(q6,conn)
    print(q6_results.head(10))
    assert (q6_results.shape == (3473, 2))

query6 = """SELECT m.title,COUNT(DISTINCT(mc.PID)) cast_count FROM Movie m JOIN
M_Cast mc ON mc.MID = m.MID GROUP BY m.MID ORDER BY cast_count DESC
"""
grader_6(query6)

                        title  cast_count
0               Ocean's Eight         238
1                    Apaharan         233
2                        Gold         215
3             My Name Is Khan         213
4  Captain America: Civil War         191
5                    Geostorm         170
6                     Striker         165
7                        2012         154
8                      Pixels         144
9       Yamla Pagla Deewana 2         140
CPU times: user 187 ms, sys: 11.1 ms, total: 198 ms
Wall time: 203 ms

### Q7 --- A decade is a sequence of 10 consecutive years. 
### For example, say in your database you have movie information starting from 1931. 
### the first decade is 1931, 1932, ..., 1940,
### the second decade is 1932, 1933, ..., 1941 and so on. 
### Find the decade D with the largest number of films and the total number of films in D.

In [37]:
%%time
def grader_7a(q7a):
    q7a_results  = pd.read_sql_query(q7a,conn)
    print(q7a_results.head(10))
    assert (q7a_results.shape == (78, 3))

query7a = """SELECT D.year AS start, D.year+9 AS end, COUNT(*) AS total_films FROM
(SELECT DISTINCT year FROM Movie) D JOIN
Movie m ON m.year >= start AND m.year <= end
GROUP BY end ORDER BY total_films desc"""

grader_7a(query7a)

# using the above query, you can write the answer to the given question

  start   end  total_films
0  2008  2017         1126
1  2009  2018         1116
2  2005  2014         1113
3  2007  2016         1112
4  2004  2013         1098
5  2006  2015         1094
6  2003  2012         1072
7  2002  2011         1049
8  2010  2019         1017
9  2001  2010         1011
CPU times: user 83 ms, sys: 0 ns, total: 83 ms
Wall time: 85.9 ms

In [38]:
%%time
def grader_7(q7):
    q7_results  = pd.read_sql_query(q7,conn)
    print(q7_results.head(10))
    assert (q7_results.shape == (1, 3))

query7 = """ SELECT D.year AS start,D.year+9 AS end, COUNT(*) AS total_films FROM
(SELECT DISTINCT year FROM Movie) D JOIN
Movie m ON m.year >= start AND m.year <= end
GROUP BY end ORDER BY total_films desc limit 1"""
grader_7(query7)
# if you check the output we are printinng all the year in that decade, its fine you can print 2008 or 2008-2017

  start   end  total_films
0  2008  2017         1126
CPU times: user 83.4 ms, sys: 0 ns, total: 83.4 ms
Wall time: 83.4 ms

## Q8 --- Find all the actors that made more movies with Yash Chopra than any other director.

In [39]:
%%time
def grader_8a(q8a):
    q8a_results  = pd.read_sql_query(q8a,conn)
    print(q8a_results.head(10))
    assert (q8a_results.shape == (73408, 3))
    
query8a = """SELECT DISTINCT mc.PID as Actor ,md.PID as Director, COUNT(m.MID) movie_count FROM Movie m JOIN M_Director md 
ON TRIM(m.MID)=TRIM(md.MID) JOIN M_Cast mc ON TRIM(md.MID)=TRIM(mc.MID) GROUP BY mc.PID,md.PID"""
grader_8a(query8a)

# using the above query, you can write the answer to the given question

        Actor   Director  movie_count
0   nm0000002  nm0496746            1
1   nm0000027  nm0000180            1
2   nm0000039  nm0896533            1
3   nm0000042  nm0896533            1
4   nm0000047  nm0004292            1
5   nm0000073  nm0485943            1
6   nm0000076  nm0000229            1
7   nm0000092  nm0178997            1
8   nm0000093  nm0000269            1
9   nm0000096  nm0113819            1
CPU times: user 49.3 s, sys: 3.13 s, total: 52.4 s
Wall time: 52.2 s

In [40]:
%%time

def grader_8(q8):
    q8_results  = pd.read_sql_query(q8,conn)
    print(q8_results.head(10))
    print(q8_results.shape)
    assert (q8_results.shape == (245, 2))

query8 = """select p.name,h.count 
from(select TRIM(mc.pid) as mcpid,TRIM(md.pid) as mdpid,count(TRIM(mc.MID)) as count   
from m_cast as mc join m_director md on TRIM(md.MID)=TRIM(mc.MID) group by TRIM(mc.pid) ,TRIM(md.pid)) h
join person p on TRIM(h.mcpid)=TRIM(p.pid) where h.count = (select count(*) as count from m_cast as mc
join m_director md on TRIM(md.mid)=TRIM(mc.mid) where TRIM(mc.pid)=TRIM(h.mcpid) 
group by TRIM(mc.pid),TRIM(md.pid) order by count(*) desc limit 1)
and TRIM(h.mdpid) = (select pid from person where name like '%Yash Chopra%') order by h.count desc
"""
grader_8(query8)

                Name  count
0        Jagdish Raj     11
1   Manmohan Krishna     10
2           Iftekhar      9
3      Shashi Kapoor      7
4      Rakhee Gulzar      5
5     Waheeda Rehman      5
6           Ravikant      4
7     Achala Sachdev      4
8        Neetu Singh      4
9      Leela Chitnis      3
(245, 2)
CPU times: user 1min, sys: 521 ms, total: 1min 1s
Wall time: 1min

## Q9 --- The Shahrukh number of an actor is the length of the shortest path between the actor and Shahrukh Khan in the "co-acting" graph. That is, Shahrukh Khan has Shahrukh number 0; all actors who acted in the same film as Shahrukh have Shahrukh number 1; all actors who acted in the same film as some actor with Shahrukh number 1 have Shahrukh number 2, etc. Return all actors whose Shahrukh number is 2.

In [26]:
q1="""select trim(p.Name) Actor_Name from Person p where trim(p.PID) in 
(select trim(mc.PID) PID_2 from m_cast mc where trim(mc.PID) not in (select trim(mc.PID) PID_1 from m_cast mc where trim(mc.MID) in
(select trim(mc.MID) MID_0 from m_cast mc where trim(mc.PID) in
(SELECT  TRIM(P.PID) PID FROM Person P WHERE Trim(P.Name)="Shah Rukh Khan"))) and trim(mc.MID) in  
(select trim(mc.MID) MID_1 from m_cast mc where trim(mc.PID) in 
(select  trim(mc.PID) PID_1 from m_cast mc where trim(mc.MID) in
(select  trim(mc.MID) MID_0 from m_cast mc where trim(mc.PID) in
(SELECT distinct TRIM(P.PID) PID FROM Person P WHERE Trim(P.Name)="Shah Rukh Khan")))));"""

pd.read_sql_query(q1,conn)

                  Actor_Name
0               Freida Pinto
1                Rohan Chand
2               Damian Young
3            Waris Ahluwalia
4      Caroline Christl Long
...                      ...
25693           Minoo Mehtab
25694        Hayley Cleghorn
25695        Nirvasha Jithoo
25696         Kamal Maharshi
25697           Mohini Manik

[25698 rows x 1 columns]